# MEPNetworkSegmentId Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPNetworkSegmentId Members
MEPNetworkSegmentId Class Constructors Methods Properties See Also
---
The MEPNetworkSegmentId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MEPNetworkSegmentId()()()() | Creates a default invalid segment id on the network. |
| MEPNetworkSegmentId(ElementId, Int32) | Creates a valid segment id on the network. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the MEPNetworkSegmentId |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValid | Verifies if this is a valid segment id. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | The element id where this analytical segment belongs. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SegmentId | The segment identifier. |

# See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace